---
type: WorksetConfiguration
namespace: Autodesk.Revit.DB
version: 2024
members: 6
tags: [revit-api, class]
---

# WorksetConfiguration

`Autodesk.Revit.DB.WorksetConfiguration` · Revit 2024 · 6 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | WorksetConfiguration | — | `` |
| Constructor | WorksetConfiguration | 2014 | `public WorksetConfiguration ()` |
| Method | Close | 2014 | `public void Close ( IList < WorksetId > worksetsToClose )` |
| Method | Dispose | — | `public void Dispose ()` |
| Method | Open | 2014 | `public void Open ( IList < WorksetId > worksetsToOpen )` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |